[
    {
    "id": "12",
    "user_id": "1",
    "album_id": "",
    "title": "SEACOM appoints new CEO",
    "content": "SEACOM has revealed the appointment of Byron Clatterbuck as its Chief Executive Officer (CEO). According to the company, Clatterbuck is an industry veteran with more than 18 years experience in the global telecommunications industry. He has held a number of senior international executive positions during his career, focusing mostly on rapidly developing markets around the world.\r\n\r\nClatterbuck joined SEACOM in 2012 as Chief Commercial Officer with responsibility for driving revenue growth from African and global service provider customers and partners. Prior to this, Clatterbuck was the President of Tata Communications\u0092 global service provider segment, a company operating the largest private subsea cable system network in the world. Prior to that, he  held senior executive positions at BT, Level 3, and REACH.\r\n\r\nBrian Herlihy, SEACOM\u0092s founder and executive director, said \u0093SEACOM has changed the African ICT landscape and it is now time for us to continue this transformation by driving new services and capabilities into Africa\u0092s marketplace. Clatterbuck will lead SEACOM into a new era of growth and leverage his operational and business development know-how to unleash the power and speed of SEACOM\u0092s global network.\u0094\r\n\r\n\u0093Africa is poised to be a key new growth driver for the global economy, and the development story of this decade, and I am pleased to have the opportunity to lend my international skills and experience to a developing company like SEACOM.  Moreover, SEACOM has a solid global reputation for innovation, integrity and quality, and I look forward to leading the great team here during such an important time in SEACOM\u0092s and Africa\u0092s development\u0094, said Clatterbuck on his appointment.",
    "expiry": "2015-04-30",
    "date_added": "2015-02-09 00:00:00"
},
{
    "id": "13",
    "user_id": "1",
    "album_id": "",
    "title": "IFC set to grow Mobile Money usage in Uganda",
    "content": "Cignifi has inked an agreement with the International Finance Corporation (IFC), which is aimed at expanding the delivery and usage of mobile financial services in Uganda.\r\n\r\nCignifi will be working with the IFC to help drive the adoption and growth of Airtel Uganda\u0092s Mobile Money platform, an e-commerce service that enables customers to use their mobile phones to send and receive money, make payments, make withdrawals from ATMs, check bank balances, deposit money from a phone, and conduct other banking functions.\r\n\r\nGreta Bull, IFC Manager, Financial Institutions Group Advisory Services Sub-Saharan Africa, stated that: \u0093Data analytics potentially offers great insights for the development of innovative products and services to extend financial inclusion in Sub-Saharan Africa. IFC is excited to be working together with Cignifi and Airtel Uganda to further explore and enhance this area of research.\u0094\r\n\r\nCignifi will use its proprietary data platform to analyse Airtel call detail records and Airtel Money transactions. Cignifi will score Airtel customers based on their propensity to use Airtel Money. The objective will be to identify prospective users that have not yet registered for the service and also to reactivate users that have registered but are currently dormant. The analysis is designed to yield a more effective, better-targeted way to market mobile money products.\r\n\r\nJonathan Hakim, CEO of Cignifi added: \u0093We are excited to be working with Airtel and the IFC on their initiative to accelerate delivery of financial services in sub-Saharan Africa. Our selection from an extremely competitive field is recognition of Cignifi\u0092s unique expertise in managing and analyzing huge mobile datasets. We will apply our behavioral analytics to help Airtel ramp up adoption of its mobile financial services in Uganda.\u0094",
    "expiry": "2015-04-30",
    "date_added": "2015-02-05 00:00:00"
},
{
    "id": "14",
    "user_id": "1",
    "album_id": "",
    "title": "He who connects wins \u0096 SAP Africa CEO",
    "content": "In this brave new world of the Networked Economy, one adage rings truer than ever: no company is an island. Mobile, cloud, social media and machine-to-machine (M2M) technologies are creating connections between people and organisations in more ways than we have ever seen \u0096 and these smarter, faster and more global networks are already starting to transform business in ways never thought possible.\r\n\r\nHow, you ask skeptically. Simple. Today\u0092s business world demands significant interaction with suppliers, trading partners, stakeholders and customers \u0096 but many of those interactions still rely on inefficient technologies like phone, e-mail, and so on. What\u0092s more, those connections tend to be with people and organisations you\u0092re already connected to, limiting the potential value.\r\n\r\nToday\u0092s Networked Economy offers opportunities for connecting to a much broader set of parties, in much more effective ways. In addition to personal contacts, today\u0092s networks bring together current and potential suppliers, partners, and customers across both the financial and physical value chains. And increasingly they include machine-to-machine sensors and devices.\r\n\r\nBut the real power of networks lies in what goes on inside them \u0096 all the interactions, transactions and commentary, and the massive amounts of insights and data that they generate. Companies that move beyond simple transactions and tap into these insights and data are finding they can drive real competitive advantage. If you\u0092re entering a new market, how do you evaluate risk? How do you determine what products suit local tastes? You have your own experts and market data, but your networks of suppliers, partners, and customers may hold much more valuable knowledge.\r\n\r\nIn the past, companies relied on one-to-one business networks, establishing a direct link between both parties. Networks were all about connecting companies more efficiently to perform a specific process like buying, selling or invoicing.\r\n\r\nToday, buyers and sellers are using networks to enhance and expand their relationships, and use many-to-many approaches that build large communities, make new contacts, share knowledge, conduct transactions, and much more. Buyers are using the connectivity and insights of networks to find the right partners and optimise their spend and supply chain. Sellers are using networks to engage with customers when, how and where they want to be engaged to increase satisfaction and wallet share.\r\n\r\nThis isn\u0092t some futuristic crystal ball-gazing. It\u0092s here and now. Social tools and business networks have already changed the nature of business and engagement. Companies today are already more connected and mobile than ever. The opportunity now is to use this greater level of connectedness to enable new processes that are only possible in a networked environment, and drive innovation across their operations.\r\n\r\nWhat\u0092s this means is that the use of business networks and social enterprise software is becoming a competitive differentiator. We\u0092re already seeing growing numbers of South African businesses harnessing the insights and intelligence of entire communities to enable new processes that drive innovation and competitive advantage.\r\n\r\nI would go so far as to say that businesses can no longer be competitive without the support of a network \u0096 and the convergence of trends like the growing use of cloud computing, the advancements of machine-to-machine technology, and the evolution of the technology powering the supply chain are leaving companies with no other choice.\r\n\r\nIt\u0092s not a terrible option to be left with, however, as companies that connect and collaborate through networks outperform their peers. McKinsey and Company reports that networked enterprises are 50% more likely than their peers to have increased sales, higher profit margins, gain market share, and be a market leader.\r\n\r\nThey are also getting closer to their customers, transforming both innovation and customer relationships. Just as consumers tap into personal networks to learn, share and shop better, companies will tap the \u0091knowledge of crowds\u0092 and insights from business networks to not only sense the present, but see the future and proactively shape it to their advantage by anticipating risks and trends in the market, and delivering the products and services that drive higher sales and greater market share.\r\n\r\nThe combination of business networks and social platforms is a game-changer \u0096 and we\u0092re just getting started. There\u0092s no doubt that the Networked Economy will have a profound impact on our future.\r\n\r\nBy Pfungwa Serima, CEO of SAP Africa",
    "expiry": "2015-04-30",
    "date_added": "2015-02-03 00:00:00"
},
{
    "id": "15",
    "user_id": "1",
    "album_id": "",
    "title": "Video Interview: \u0093Africa\u0092s mobile future is exciting\u0094 \u0096 Brett Loubser",
    "content": "IT News Africa caught up with Brett Loubser, WeChat\u0092s head of Africa, at the Tech4Africa conference \u0096 which was held at the Sci Bono Centre in Johannesburg.\r\n\r\nRecently, IT News Africa also spoke to Gareth Knight, creator of Tech4Africa in order to discuss the concept of the USD $50 smartphone as well as its impact on Africa. Knight also listed the Top 10 benefits of the $50 smartphone in Africa, which can be viewed here.\r\n\r\nAt the event, Loubser discussed the following topics with IT News Africa:\r\n\r\n- The evolution of social.\r\n\r\n- The fact that WeChat is designed to work in concert with its users and become a point of connection and control for their entire lives \u0096 both on and offline.\r\n\r\n- The importance of making value-added services available to users and businesses alike, to ensure they receive a differentiated social experience.\r\n\r\n- The future of mobile in Africa.\r\n\r\nDarryl Linington",
    "expiry": "2015-04-30",
    "date_added": "2014-10-14 00:00:00"
},
{
    "id": "16",
    "user_id": "1",
    "album_id": "",
    "title": "Mobile is revolutionising business in Africa",
    "content": "Twinpine Network held its #KuunganaKE event at the Intercontinental Hotel in Nairobi recently. The event highlighted the opportunities for businesses through the mobile web.\r\n\r\nElo Umeh, Chief Executive Officer and Founder, Twinpine Network, in his opening remarks emphasised the role of innovation and creativity in the business world, \u0093The entire African economy is going through a revolution and businesses have begun to seek for better ways to market their products and connect with their customers. Today\u0092s Marketing is mobile and mobile advertising has become a key driver of businesses in Africa.\u0094\r\n\r\nRegional Manager, East Africa, Thomas Mbalu, who gave a presentation on the event\u0092s theme \u0091Discovering the Mobile Web in Africa\u0092, analysed the impact of the mobile web in the region stating that mobile is central to the everyday life of Africans, and that research had shown that seventy percent of smartphone users do not go an hour without checking their mobile phone.\r\n\r\n\u0093As more and more Kenyans and Africans grow online mainly through their mobile phones, advertisers and brand owners have got to fish only where the fishes are,\u0094 Mbalu said.\r\n\r\nAlso at the event, Product Manager, Eniola Moronfolu, said that Twinpine, through its advertising formats, enables experiences for mobile users, gives brands prime positioning and publishers more revenue. Moronfolu stated that the Twinpine self-serve platform on which advertising campaigns run is fast, efficient and intelligent.\r\n\r\nThe Kuungana event series hosted by Twinpine explores the expansion and outlook of business in Africa, and is part of the organisation\u0092s \u0091Engage, Educate, Empower\u0092 strategy. The series will be continued in other countries in the following months.\r\n\r\nStaff Writer",
    "expiry": "2015-04-30",
    "date_added": "2014-09-04 00:00:00"
},
{
    "id": "17",
    "user_id": "1",
    "album_id": "",
    "title": "Zimbabweans can now pay phone bills with telecash",
    "content": "It is now possible to pay telephone bills with telecash, following an agreement between Telecel Zimbabwe and TelOne, making it possible to avoid queuing to pay phone bills.\r\n\r\nTelecash subscribers can now pay their phone bills using their mobile phone to make the payment.\r\n\r\nAll that they need to do is dial  *888# to access the telecash menu, select the \u0091pay bill\u0092 option and then select Tel One. They will be asked to enter their telephone account number and the amount to be paid. It is as simple as that.\r\n\r\nAs with all telecash transactions, they will be asked to enter their telecash personal identification number (PIN) during the transaction to confirm their identity as the holder of the telecash account connected with their mobile phone.\r\n\r\nOnce payment has been made the subscriber will receive a transaction ID that can be quoted, like a receipt number, in the event of any query. Crediting of the TelOne account takes place almost instantaneously.\r\n\r\nIt is possible to add Tel One to the list of favourites on the telecash menu, so that in future when making payment Tel One can be selected quickly from that list.\r\n\r\nTelecash is an electronic wallet, into which money can be deposited and withdrawn at any telecash agent and from which payments can be made for bills and goods and services. Money can also be transferred from a telecash account to the mobile phone of anyone else, regardless of network.\r\n\r\nIt can also be transferred to a bank account held with a bank that is connected to the ZimSwitch Zipit platform. Salaries can be paid into a telecash account using the telecash bulk payments facility.\r\n\r\nAll that is needed to take advantage of telecash is to have a Telecel line and register for telecash at a Telecel shop or telecash agent or with one of the telecash ambassadors who can be identified by their telecash regalia on the streets of cities and major towns.\r\n\r\nAll Bon Marche, OK Bazaars and TM supermarkets are telecash agents, as too are all post offices.  There are also numerous small agencies, which can be identified by the telecash logo and telecash agent number.\r\n\r\n \r\n\r\nStaff writer",
    "expiry": "",
    "date_added": "2014-06-04 00:00:00"
},
{
    "id": "18",
    "user_id": "1",
    "album_id": "",
    "title": "Gray market mobile handsets thrive in Kenya",
    "content": "Kenya\u0092s mobile handset market recorded year-on-year volume growth of 21.5% in Q1 2014, according to preliminary figures announced today by International Data Corporation (IDC). While various economic and social factors continued to help push this growth, the positive quarterly performance was primarily driven by a vibrant gray market that was boosted by the September 2013 re-introduction of VAT on handsets and other electronic devices.\r\n\r\n\u0093Gray market dealers have been the main beneficiaries of the government\u0092s decision to re-introduce VAT in late 2013, while official channel partners have been badly hit,\u0094 says James Mutua, a research analyst with IDC East Africa. \u0093Gray market dealers are known to source their handsets from unofficial\/unauthorized channels, which makes their gadgets cheaper than the same products sourced through official partners.\u0094\r\n\r\nThe Kenyan government had exempted mobile handsets from VAT in June 2009. This generated significant benefits for many Kenyans and led to an increase in the volume of shipments to the country, but this all changed with the return of the levy. \u0093An unfair playing field has emerged since these new taxes were implemented, and as a result gray market dealers now account for more than two-thirds of the mobile handset market\u0092s volume,\u0094 continues Mutua. \u0093Moreover, these estimates are conservative; the numbers may be significantly higher as some official channel partners are claiming to have lost more than half of their normal monthly run rate business.\r\n\r\nIDC\u0092s latest figures show that smartphone shipments were up 104.6% year on year in Q1 2014, against a paltry rise of just 3.6% for feature phones over the same period. The smartphone category increased its unit share of the overall handset market to 29.8% for the period under review as more consumers invested in the various new gadgets launched since the start of Q4 2013. Some of the models recently introduced to the Kenyan market include, but are not limited to, the LG L1, LG L4, Nokia X, Nokia Lumia 1320, Nokia Lumia 1520, Samsung S3 Lite, Samsung Galaxy Grand 2, Samsung S5, Sony Xperia M2, Apple iPhone 5, Tecno M3, Tecno R7, and various devices from Infinix.\r\n\r\nThe overall handset market in Kenya is dominated by three vendors, namely Nokia, Tecno, and Samsung. Combined, these vendors control around 75% of the market\u0092s total volume. Devices with 2G and 2.5G interfaces still dominate the Kenya handset market. However, 3G and 4G-enabled devices continued to record healthy year-on-year volume growth in Q1 2014 of 67.0% and 207.4% respectively. This is an indication that the Kenyan market\u0092s user base is increasingly ready to join the rest of the world in shifting to LTE.\r\n\r\nHowever, Kenya\u0092s case for 4G (LTE) infrastructure remains in limbo as operators are yet to identify the best network deployment model. IDC expects Kenya to move faster toward 4G deployment once key market stakeholders have agreed on the best approach to take.\r\n\r\nWith prices declining and increasing numbers of Kenyans now accessing the Internet via mobile phones, IDC expects the smartphone segment to continue recording healthy growth over the coming quarters. However, the government needs to be alert to the challenges that lie ahead in terms of the market\u0092s composition, particularly when genuine tax-compliant businesses lose out to gray market dealers that may not fully adhere to the relevant taxation requirements.",
    "expiry": "2015-04-30",
    "date_added": "2014-05-30 00:00:00"
},
{
    "id": "19",
    "user_id": "1",
    "album_id": "",
    "title": "Nigeria: How to access Wikipedia for free",
    "content": "Leading telecommunications services provider, Airtel Nigeria, has announced a strategic partnership with the Wikimedia Foundation, the non-profit that operates Wikipedia, to offer their consumers across the country access to Wikipedia through their mobile phones free of data charges.\r\nThe initiative, which is first of its kind in Nigeria, is dubbed Wikipedia Zero, and it is aimed at reaching and empowering billions of people around the world whose access to the Internet is primarily through a mobile device. Airtel Nigeria subscribers can access Wikipedia free of data charges at m.wikipedia.org.\r\n\r\nWith the new partnership, Airtel will help deliver knowledge and information of Wikipedia to 21 million of new users in the West African region.\r\nSpeaking on the new partnership, Chief Commercial Officer, Airtel Nigeria, Maurice Newa, said the initiative is in line with the company\u0092s corporate vision of becoming Nigeria\u0092s number one Internet Company, saying the new service will help connect Nigerians with relevant knowledge and information that will empower them to succeed in their personal and professional endeavours.\r\n\r\n\u0093We are excited with our partnership with the Wikimedia Foundation and we will continue to provide innovative solutions that will uplift Nigerians in line with our brand promise of becoming the most loved brand in the daily lives of Nigerians. At Airtel, we are passionate and committed to creating solid educational and youth empowerment platforms that will enrich and transform the lives of telecoms consumers across the country,\u0094 he said.\r\n\r\n\u0093We commend Airtel Nigeria for taking a leadership role in empowering their society through information access, and we\u0092re thrilled to partner with them,\u0094 said Carolynne Schloeder, Head of Mobile Partnerships at the Wikimedia Foundation. \u0093Expanding Wikipedia Zero to the people of Nigeria is a big step forward for free knowledge in Africa.\u0094 ",
    "expiry": "2015-04-30",
    "date_added": "2014-05-29 00:00:00"
},
{
    "id": "20",
    "user_id": "1",
    "album_id": "",
    "title": "South Africa: Entrepreneur broadcasts jobs with BBM",
    "content": "The Dala U Crew (DUC) is helping thousands of young South Africans to find jobs by tapping into the power of the BBM\u0099, a leading mobile messaging platform for private and secure communications.\r\n\r\nThe initiative, brainchild of young Durban businessman Sanjeev Singh, uses BBM to broadcast job opportunities to a community of 24,000 people.\r\n\r\nDUC started out as youth community focused on keeping people informed about parties, clubs and other events. Singh decided to tap into this community to help people find jobs after a number of people approached him to help them with their searches for employment. Over the past two years, the community has blossomed and Singh carries job advertisements from a range of employers on BBM every week.\r\n\r\nSays Singh: \u0093I realised that BBM would be a wonderful avenue for helping people to find jobs, because it could connect thousands of people around the country to employment opportunities. Now that BBM is available on Android\u0099 and iPhone devices as well as BlackBerry smartphones, nearly anyone has access to the BBM capabilities.\u0094\r\n\r\nSince he started using BBM to connect the community to job opportunities, Singh has quietly helped thousands of South Africans to find jobs. Some employers get 300 to 400 responses for their ads, and around 200 people per week join the DUC community. More recently, Singh set up a DUC mobisite, which gets thousands of views a week.\r\n\r\nNow, DUC plan is also offering other classifieds ads in addition to the job ads. Contacts are able to browse an assortment of services available ranging from jobs, cars for sale, services and photos from events on the company\u0092s mobi site. \u0093The immediacy, reliability and accessibility of BBM is helping us to make a real difference in people\u0092s lives,\u0094 says Singh.\r\n\r\nStaff writer",
    "expiry": "2015-04-30",
    "date_added": "2014-05-27 00:00:00"
},
{
    "id": "21",
    "user_id": "1",
    "album_id": "",
    "title": "Standard Bank launches game-changing payment app",
    "content": "Standard Bank today announced the launch of their mobile payment app, SnapScan. This is the bank\u0092s first mobile payment offering that allows merchants to receive payments from their customers through a combination of a QR code and a secure PIN number.\r\n\r\nAccording to Standard Bank\u0092s Head of Innovation and Channel Design, Vuyo Mpako, \u0093We are excited to bring such innovative offerings to all South African businesses. We created this app together with Stellenbosch-based IT agency, FireID in 2013, and it went on to win the 2013 MTN Business\u0092 App of the year award. After extensive beta testing, we\u0092re ready to take this solution to market.\u0094\r\n\r\nThe challenge that many small enterprises face is the cost of setting up a POS machine combined with interrupted or unreliable connectivity, for example a small business trading at a Saturday market. SnapScan enables small business owners who wouldn\u0092t normally qualify as merchants, to become fully-fledged merchants. All that is required to become a merchant is for the business to register with SnapScan, print the unique QR code and any mobile phone. The business owner can now accept payments from anyone using the SnapScan application.\r\n\r\n\u0093SnapScan works amazingly well for formal and informal enterprises alike. We have created a solution that is as easy to install as it is to collect payments. Our business strategy at Standard Bank is to create accessible, convenient and secure solutions for businesses. SnapScan is a pioneering first,\u0094 says Mr Mpako.\r\n\r\nThe process of transacting with this app is really simple. Once the unique QR code has been scanned, purchases are made with a user-selected PIN and the business owner will receive a SMS notification from Standard Bank confirming the transaction. Merchants don\u0092t need any high-tech devices or connectivity \u0096 all payment confirmations are delivered using the standard SMS service.\r\n\r\n\u0093For small businesses, this is so much more than an app; it\u0092s a real-time retail payment solution that allows business owners safe, secure and convenient payment methods for their customers. Having SnapScan also minimises potential loss due to the lack of a POS system, essentially creating another sales stream.\r\n\r\n\u0093South Africa has seen a proliferation of smartphones and an increase in apps available to the consumer. There are apps for almost everything from smart diaries to smart banking. A safe and convenient cashless mobile solution was imminent and Standard Bank found it in SnapScan,\u0094 says Mr Mpako.\r\n\r\nCollection of funds\r\nSnapScan offers two avenues for the collection of funds. Informal businesses are able to withdraw their earnings by requesting a voucher that can be redeemed at any Spar outlet, or at a Standard Bank ATM. The business owner does not need to have a Standard Bank account to do so.\r\n\r\nThe second option is more geared towards formal businesses, where the sales are directly credited to the nominated business banking account.\r\n\r\nSafety\r\nThe app is extremely secure which minimises card fraud. With the SMS notification service as proof of payment, the business can be sure that the payment is legitimate.\r\n\r\nSnapScan has been successful in businesses across the country and early adopters of this solution include Motherland in Johannesburg and House of Machines in Cape Town.",
    "expiry": "2015-04-30",
    "date_added": "2014-05-21 00:00:00"
}
]
